#+title: KVineet's Emacs Configuration
#+author: Vineet Kulkarni
#+email: mail@kvineet.in
#+startup: overview
#+filetags: :NOTSTUCK:
#+TODO: TODO(t) | DONE(d)
#+TODO: | .(.)
#+property: header-args :comments no :noweb no-export :mkdirp yes :tangle no
#+html_head: <link rel='shortcut icon' type='image/png' href='https://www.gnu.org/software/emacs/favicon.png'>
https://github.com/tecosaur/emacs-config/blob/master/config.org
**** Some files are never meant to getting stuck
Don't want things in stuck projects that can never get stuck. There probably is
better way of doing this in future. But for now, we use a special tag =:NOTSTUCK:=

Any heading marked with =:NOTSTUCK:= will not constitute a project. In practice we add ~filetags~ with value ~:NOTSTUCK:~ to the org file.

Denote uses ~filetags~ in front matter to generate its file naming scheme, but we do not want ~notstuck~ appearing in the file names.

In such cases, put two declarations of the ~filetag~ in front matter. Denote will only pick first declaration, while subsequent declarations would get ignored by denote.
#+BEGIN_SRC emacs-lisp :tangle config.el
(setq org-stuck-projects '("+LEVEL=2-NOTSTUCK/-DONE-KILL"
                           ("TODO" "NEXT")
                           nil ""))
#+END_SRC

#+RESULTS:
| +LEVEL=2-NOTSTUCK/-DONE-KILL | (TODO NEXT) | nil |   |

